## Staging: app
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to move, 16 to add, 1 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                   NAME                                                    |
|--------|-----------------------------------------------------------------------------------------------------------|
| add    | `module.gc_forms_code_pipeline[0].aws_codebuild_project.ecs_render`                                       |
|        | `module.gc_forms_code_pipeline[0].aws_codedeploy_app.this`                                                |
|        | `module.gc_forms_code_pipeline[0].aws_codedeploy_deployment_group.this`                                   |
|        | `module.gc_forms_code_pipeline[0].aws_codepipeline.this`                                                  |
|        | `module.gc_forms_code_pipeline[0].aws_codepipeline_webhook.this`                                          |
|        | `module.gc_forms_code_pipeline[0].aws_codestarconnections_connection.this`                                |
|        | `module.gc_forms_code_pipeline[0].aws_iam_role.this`                                                      |
|        | `module.gc_forms_code_pipeline[0].aws_iam_role_policy.codepipeline_policy`                                |
|        | `module.gc_forms_code_pipeline[0].aws_iam_role_policy_attachment.AWSCodeDeployRole`                       |
|        | `module.gc_forms_code_pipeline[0].aws_iam_role_policy_attachment.AWSCodeDeployRoleForECS`                 |
|        | `module.gc_forms_code_pipeline[0].aws_s3_bucket.codepipeline_bucket`                                      |
|        | `module.gc_forms_code_pipeline[0].aws_s3_bucket_ownership_controls.codepipeline_bucket`                   |
|        | `module.gc_forms_code_pipeline[0].aws_s3_bucket_public_access_block.codepipeline_bucket`                  |
|        | `module.gc_forms_code_pipeline[0].aws_s3_bucket_server_side_encryption_configuration.codepipeline_bucket` |
|        | `module.gc_forms_code_pipeline[0].aws_secretsmanager_secret.this`                                         |
|        | `module.gc_forms_code_pipeline[0].aws_secretsmanager_secret_version.this`                                 |
| delete | `aws_codedeploy_app.app[0]`                                                                               |
|        | `aws_codedeploy_deployment_group.app[0]`                                                                  |
| update | `aws_ecs_task_definition.form_viewer`                                                                     |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/forms-terraform/actions/runs/21960965900).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_codedeploy_app.app[0] will be destroyed
  # (because index [0] is out of range for count)
  # (moved from aws_codedeploy_app.app)
  - resource "aws_codedeploy_app" "app" {
      - application_id      = "0f72daa1-71c1-447c-8688-f0bce16d40d5" -> null
      - arn                 = "arn:aws:codedeploy:ca-central-1:687401027353:application:AppECS-Forms-form-viewer" -> null
      - compute_platform    = "ECS" -> null
      - id                  = "0f72daa1-71c1-447c-8688-f0bce16d40d5:AppECS-Forms-form-viewer" -> null
      - linked_to_github    = false -> null
      - name                = "AppECS-Forms-form-viewer" -> null
      - region              = "ca-central-1" -> null
      - tags                = {} -> null
      - tags_all            = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
        # (1 unchanged attribute hidden)
    }

  # aws_codedeploy_deployment_group.app[0] will be destroyed
  # (because index [0] is out of range for count)
  # (moved from aws_codedeploy_deployment_group.app)
  - resource "aws_codedeploy_deployment_group" "app" {
      - app_name                    = "AppECS-Forms-form-viewer" -> null
      - arn                         = "arn:aws:codedeploy:ca-central-1:687401027353:deploymentgroup:AppECS-Forms-form-viewer/DgpECS-Forms-form-viewer" -> null
      - autoscaling_groups          = [] -> null
      - compute_platform            = "ECS" -> null
      - deployment_config_name      = "CodeDeployDefault.ECSAllAtOnce" -> null
      - deployment_group_id         = "65eae5e8-0f0d-46c8-8f2b-712fa56ecd0a" -> null
      - deployment_group_name       = "DgpECS-Forms-form-viewer" -> null
      - id                          = "65eae5e8-0f0d-46c8-8f2b-712fa56ecd0a" -> null
      - outdated_instances_strategy = "UPDATE" -> null
      - region                      = "ca-central-1" -> null
      - service_role_arn            = "arn:aws:iam::687401027353:role/codedeploy" -> null
      - tags                        = {} -> null
      - tags_all                    = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - termination_hook_enabled    = false -> null

      - auto_rollback_configuration {
          - enabled = true -> null
          - events  = [
              - "DEPLOYMENT_FAILURE",
            ] -> null
        }

      - blue_green_deployment_config {
          - deployment_ready_option {
              - action_on_timeout    = "CONTINUE_DEPLOYMENT" -> null
              - wait_time_in_minutes = 0 -> null
            }
          - terminate_blue_instances_on_deployment_success {
              - action                           = "TERMINATE" -> null
              - termination_wait_time_in_minutes = 1 -> null
            }
        }

      - deployment_style {
          - deployment_option = "WITH_TRAFFIC_CONTROL" -> null
          - deployment_type   = "BLUE_GREEN" -> null
        }

      - ecs_service {
          - cluster_name = "Forms" -> null
          - service_name = "form-viewer" -> null
        }

      - load_balancer_info {
          - target_group_pair_info {
              - prod_traffic_route {
                  - listener_arns = [
                      - "arn:aws:elasticloadbalancing:ca-central-1:687401027353:listener/app/form-viewer/5e6bc2d9ab810b68/028e8eeeed9c3a34",
                    ] -> null
                }
              - target_group {
                  - name = "form-viewer" -> null
                }
              - target_group {
                  - name = "form-viewer-2" -> null
                }
            }
        }
    }

  # aws_ecs_task_definition.form_viewer will be updated in-place
  ~ resource "aws_ecs_task_definition" "form_viewer" {
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ container_definitions    = (sensitive value)
        id                       = "form-viewer"
        tags                     = {}
        # (17 unchanged attributes hidden)
    }

  # module.gc_forms_code_pipeline[0].data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.gc_forms_code_pipeline[0].data.aws_ecs_task_definition.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = (known after apply)
      + enable_fault_injection   = (known after apply)
      + ephemeral_storage        = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = (known after apply)
      + id                       = (known after apply)
      + ipc_mode                 = (known after apply)
      + memory                   = (known after apply)
      + network_mode             = (known after apply)
      + pid_mode                 = (known after apply)
      + placement_constraints    = (known after apply)
      + proxy_configuration      = (known after apply)
      + region                   = (known after apply)
      + requires_compatibilities = (known after apply)
      + revision                 = (known after apply)
      + runtime_platform         = (known after apply)
      + status                   = (known after apply)
      + task_definition          = "form-viewer"
      + task_role_arn            = (known after apply)
      + volume                   = (known after apply)
    }

  # module.gc_forms_code_pipeline[0].data.aws_iam_policy_document.assume_role will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "assume_role" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + "codebuild.amazonaws.com",
                  + "codedeploy.amazonaws.com",
                  + "codepipeline.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.gc_forms_code_pipeline[0].data.aws_iam_policy_document.codepipeline_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "codepipeline_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetBucketVersioning",
              + "s3:GetObject",
              + "s3:GetObjectVersion",
              + "s3:PutObject",
              + "s3:PutObjectAcl",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "codestar-connections:UseConnection",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "codebuild:BatchGetBuilds",
              + "codebuild:StartBuild",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "codeconnections:GetConnection",
              + "codeconnections:GetConnectionToken",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:CompleteLayerUpload",
              + "ecr:DescribeRepositories",
              + "ecr:GetAuthorizationToken",
              + "ecr:GetDownloadUrlForLayer",
              + "ecr:InitiateLayerUpload",
              + "ecr:PutImage",
              + "ecr:UploadLayerPart",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "codedeploy:CreateDeployment",
              + "codedeploy:GetDeployment",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "codedeploy:GetApplication",
              + "codedeploy:GetApplicationRevision",
              + "codedeploy:RegisterApplicationRevision",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "codedeploy:GetDeploymentConfig",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ecs:DescribeServices",
              + "ecs:DescribeTaskDefinition",
              + "ecs:RegisterTaskDefinition",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:CreateNetworkInterface",
              + "ec2:DeleteNetworkInterface",
              + "ec2:DescribeDhcpOptions",
              + "ec2:DescribeNetworkInterfaces",
              + "ec2:DescribeSecurityGroups",
              + "ec2:DescribeSubnets",
              + "ec2:DescribeVpcs",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:CreateNetworkInterfacePermission",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "codestar-connections:UseConnection",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:iam::*:role/Service*",
            ]
        }
      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:secretsmanager:ca-central-1:687401027353:secret:server-database-url-0PSpE3",
            ]
        }
    }

  # module.gc_forms_code_pipeline[0].data.aws_lb_target_group.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_lb_target_group" "this" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = (known after apply)
      + health_check                       = (known after apply)
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = (known after apply)
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "form-viewer"
      + port                               = (known after apply)
      + preserve_client_ip                 = (known after apply)
      + protocol                           = (known after apply)
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = (known after apply)
      + region                             = (known after apply)
      + slow_start                         = (known after apply)
      + stickiness                         = (known after apply)
      + tags                               = (known after apply)
      + target_type                        = (known after apply)
      + vpc_id                             = (known after apply)
    }

  # module.gc_forms_code_pipeline[0].data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + region      = (known after apply)
    }

  # module.gc_forms_code_pipeline[0].aws_codebuild_project.ecs_render will be created
  + resource "aws_codebuild_project" "ecs_render" {
      + arn                  = (known after apply)
      + badge_enabled        = false
      + badge_url            = (known after apply)
      + build_timeout        = 10
      + description          = "Render ECS files for gc-forms-web-app"
      + encryption_key       = (known after apply)
      + id                   = (known after apply)
      + name                 = "ECS-Render-gc-forms-web-app"
      + project_visibility   = "PRIVATE"
      + public_project_alias = (known after apply)
      + queued_timeout       = 480
      + region               = "ca-central-1"
      + service_role         = (known after apply)
      + tags_all             = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + artifacts {
          + encryption_disabled    = false
          + override_artifact_name = false
          + type                   = "CODEPIPELINE"
        }

      + cache {
          + type = "NO_CACHE"
        }

      + environment {
          + compute_type                = "BUILD_GENERAL1_SMALL"
          + image                       = "aws/codebuild/amazonlinux2-x86_64-standard:5.0"
          + image_pull_credentials_type = "CODEBUILD"
          + privileged_mode             = true
          + type                        = "LINUX_CONTAINER"
        }

      + logs_config {
          + cloudwatch_logs {
              + group_name  = "Cloud-Build-gc-forms-web-app"
              + status      = "ENABLED"
              + stream_name = "ecs-render"
            }
        }

      + source {
          + buildspec = (sensitive value)
          + type      = "CODEPIPELINE"
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0270968f823b36030",
            ]
          + subnets            = [
              + "subnet-07e38df0760d389d1",
              + "subnet-07f9debd31e48ce64",
              + "subnet-0af8e6e3cf80f582d",
            ]
          + vpc_id             = "vpc-0ad5b3739860129d0"
        }
    }

  # module.gc_forms_code_pipeline[0].aws_codedeploy_app.this will be created
  + resource "aws_codedeploy_app" "this" {
      + application_id      = (known after apply)
      + arn                 = (known after apply)
      + compute_platform    = "ECS"
      + github_account_name = (known after apply)
      + id                  = (known after apply)
      + linked_to_github    = (known after apply)
      + name                = "gc-forms-web-app"
      + region              = "ca-central-1"
      + tags_all            = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # module.gc_forms_code_pipeline[0].aws_codedeploy_deployment_group.this will be created
  + resource "aws_codedeploy_deployment_group" "this" {
      + app_name                    = "gc-forms-web-app"
      + arn                         = (known after apply)
      + compute_platform            = (known after apply)
      + deployment_config_name      = "CodeDeployDefault.ECSAllAtOnce"
      + deployment_group_id         = (known after apply)
      + deployment_group_name       = "gc-forms-web-app"
      + id                          = (known after apply)
      + outdated_instances_strategy = "UPDATE"
      + region                      = "ca-central-1"
      + service_role_arn            = (known after apply)
      + tags_all                    = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + termination_hook_enabled    = false

      + auto_rollback_configuration {
          + enabled = true
          + events  = [
              + "DEPLOYMENT_FAILURE",
            ]
        }

      + blue_green_deployment_config {
          + deployment_ready_option {
              + action_on_timeout = "CONTINUE_DEPLOYMENT"
            }
          + green_fleet_provisioning_option (known after apply)
          + terminate_blue_instances_on_deployment_success {
              + action                           = "TERMINATE"
              + termination_wait_time_in_minutes = 1
            }
        }

      + deployment_style {
          + deployment_option = "WITH_TRAFFIC_CONTROL"
          + deployment_type   = "BLUE_GREEN"
        }

      + ecs_service {
          + cluster_name = "Forms"
          + service_name = "form-viewer"
        }

      + load_balancer_info {
          + target_group_pair_info {
              + prod_traffic_route {
                  + listener_arns = [
                      + "arn:aws:elasticloadbalancing:ca-central-1:687401027353:listener/app/form-viewer/5e6bc2d9ab810b68/028e8eeeed9c3a34",
                    ]
                }
              + target_group {
                  + name = "form-viewer"
                }
              + target_group {
                  + name = "form-viewer-2"
                }
            }
        }
    }

  # module.gc_forms_code_pipeline[0].aws_codepipeline.this will be created
  + resource "aws_codepipeline" "this" {
      + arn            = (known after apply)
      + execution_mode = "SUPERSEDED"
      + id             = (known after apply)
      + name           = "gc-forms-web-app-pipeline"
      + pipeline_type  = "V2"
      + region         = "ca-central-1"
      + role_arn       = (known after apply)
      + tags_all       = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + trigger_all    = (known after apply)

      + artifact_store {
          + location = (known after apply)
          + type     = "S3"
            # (1 unchanged attribute hidden)
        }

      + stage {
          + name = "Source"

          + action {
              + category         = "Source"
              + configuration    = (known after apply)
              + name             = "Source"
              + namespace        = "GitSource"
              + output_artifacts = [
                  + "source_output",
                ]
              + owner            = "AWS"
              + provider         = "CodeStarSourceConnection"
              + region           = (known after apply)
              + run_order        = (known after apply)
              + version          = "1"
            }
        }
      + stage {
          + name = "Build"

          + action {
              + category         = "Build"
              + configuration    = (known after apply)
              + input_artifacts  = [
                  + "source_output",
                ]
              + name             = "Render_For_ECS"
              + namespace        = "RenderSource"
              + output_artifacts = [
                  + "render_output",
                ]
              + owner            = "AWS"
              + provider         = "CodeBuild"
              + region           = (known after apply)
              + run_order        = 1
              + version          = "1"
            }
        }
      + stage {
          + name = "Deploy"

          + action {
              + category        = "Deploy"
              + configuration   = {
                  + "AppSpecTemplateArtifact"        = "render_output"
                  + "AppSpecTemplatePath"            = "appspec.yaml"
                  + "ApplicationName"                = "gc-forms-web-app"
                  + "DeploymentGroupName"            = "gc-forms-web-app"
                  + "TaskDefinitionTemplateArtifact" = "render_output"
                  + "TaskDefinitionTemplatePath"     = "task_definition.json"
                }
              + input_artifacts = [
                  + "render_output",
                ]
              + name            = "Deploy"
              + owner           = "AWS"
              + provider        = "CodeDeployToECS"
              + region          = (known after apply)
              + run_order       = (known after apply)
              + version         = "1"
            }
        }
    }

  # module.gc_forms_code_pipeline[0].aws_codepipeline_webhook.this will be created
  + resource "aws_codepipeline_webhook" "this" {
      + arn             = (known after apply)
      + authentication  = "GITHUB_HMAC"
      + id              = (known after apply)
      + name            = "github-webhook-gc-forms-web-app"
      + region          = "ca-central-1"
      + tags_all        = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + target_action   = "Source"
      + target_pipeline = "gc-forms-web-app-pipeline"
      + url             = (known after apply)

      + authentication_configuration {
          + secret_token = (sensitive value)
        }

      + filter {
          + json_path    = "$.ref"
          + match_equals = "refs/heads/{Branch}"
        }
    }

  # module.gc_forms_code_pipeline[0].aws_codestarconnections_connection.this will be created
  + resource "aws_codestarconnections_connection" "this" {
      + arn               = (known after apply)
      + connection_status = (known after apply)
      + id                = (known after apply)
      + name              = "gc-forms-web-app-GitHub"
      + provider_type     = "GitHub"
      + region            = "ca-central-1"
      + tags_all          = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # module.gc_forms_code_pipeline[0].aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "Code-Pipeline-gc-forms-web-app"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.gc_forms_code_pipeline[0].aws_iam_role_policy.codepipeline_policy will be created
  + resource "aws_iam_role_policy" "codepipeline_policy" {
      + id          = (known after apply)
      + name        = "codepipeline_policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.gc_forms_code_pipeline[0].aws_iam_role_policy_attachment.AWSCodeDeployRole will be created
  + resource "aws_iam_role_policy_attachment" "AWSCodeDeployRole" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSCodeDeployRole"
      + role       = "Code-Pipeline-gc-forms-web-app"
    }

  # module.gc_forms_code_pipeline[0].aws_iam_role_policy_attachment.AWSCodeDeployRoleForECS will be created
  + resource "aws_iam_role_policy_attachment" "AWSCodeDeployRoleForECS" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSCodeDeployRoleForECS"
      + role       = "Code-Pipeline-gc-forms-web-app"
    }

  # module.gc_forms_code_pipeline[0].aws_s3_bucket.codepipeline_bucket will be created
  + resource "aws_s3_bucket" "codepipeline_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ca-central-1"
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.gc_forms_code_pipeline[0].aws_s3_bucket_ownership_controls.codepipeline_bucket will be created
  + resource "aws_s3_bucket_ownership_controls" "codepipeline_bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ca-central-1"

      + rule {
          + object_ownership = "BucketOwnerEnforced"
        }
    }

  # module.gc_forms_code_pipeline[0].aws_s3_bucket_public_access_block.codepipeline_bucket will be created
  + resource "aws_s3_bucket_public_access_block" "codepipeline_bucket" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "ca-central-1"
      + restrict_public_buckets = true
    }

  # module.gc_forms_code_pipeline[0].aws_s3_bucket_server_side_encryption_configuration.codepipeline_bucket will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "codepipeline_bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ca-central-1"

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.gc_forms_code_pipeline[0].aws_secretsmanager_secret.this will be created
  + resource "aws_secretsmanager_secret" "this" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "github-webhook-gc-forms-web-app_1"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + region                         = "ca-central-1"
      + tags_all                       = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + replica (known after apply)
    }

  # module.gc_forms_code_pipeline[0].aws_secretsmanager_secret_version.this will be created
  + resource "aws_secretsmanager_secret_version" "this" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + region               = "ca-central-1"
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

Plan: 16 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_appautoscaling_target.forms[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.forms"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_cluster.forms"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_service.form_viewer"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.form_viewer"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.cognito"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.ecs_xray"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.forms_audit_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.forms_dynamodb"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.forms_kms"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.forms_s3"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.forms_secrets_manager"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.forms_sqs"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.codedeploy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.forms"]
WARN - plan.json - main - Missing Common Tags: ["module.gc_forms_code_pipeline[0].aws_codebuild_project.ecs_render"]
WARN - plan.json - main - Missing Common Tags: ["module.gc_forms_code_pipeline[0].aws_codedeploy_app.this"]
WARN - plan.json - main - Missing Common Tags: ["module.gc_forms_code_pipeline[0].aws_codedeploy_deployment_group.this"]
WARN - plan.json - main - Missing Common Tags: ["module.gc_forms_code_pipeline[0].aws_codepipeline.this"]
WARN - plan.json - main - Missing Common Tags: ["module.gc_forms_code_pipeline[0].aws_codepipeline_webhook.this"]
WARN - plan.json - main - Missing Common Tags: ["module.gc_forms_code_pipeline[0].aws_codestarconnections_connection.this"]
WARN - plan.json - main - Missing Common Tags: ["module.gc_forms_code_pipeline[0].aws_iam_role.this"]
WARN - plan.json - main -...
```

</details>
